app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "First"], ["created_at", Tue, 23 Apr 2013 09:55:24 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 23 Apr 2013 09:55:24 UTC +00:00]]
---
  def create
      @post = Post.find(params[:post_id])
      @comment = @post.comments.create!(params[:comment])